# First print your name in the cell below then save this file. (or something nice about your instructor)

In [3]:
# In this cell print your name 
print("Jawad")

Jawad

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [4]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [5]:
# Load data here
df=pd.read_csv('data/listings.csv')
df.shape

(46527, 16)

In [6]:
df.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365'],
      dtype='object')

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [7]:
# 1. How many listings are there with a price less than 100? 
price_cond=df['price']<100
price_df=df[price_cond]
len(price_df)

22778

In [9]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.
bk_cond=df['neighbourhood_group']=='Brooklyn'
df_bk= df[bk_cond]
len(df_bk)

18632

In [10]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.
bk_listing= df[bk_cond & price_cond]
len(bk_listing)

10473

In [24]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names
name_cond=['Michael', 'David', 'John', 'Daniel']
name_df=df['host_name'].isin(name_cond)
len(name_df[name_df == True])

1258

In [8]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 
df['adjusted_price'] = df['price']
df.loc[df['neighbourhood'] == 'Williamsburg', 'adjusted_price'] += 100
print(df[df['price'] != df['adjusted_price']])

             id                                               name    host_id  \
11         6848                   Only 2 stops to Manhattan studio      15991
15         7801                   Sweet and Spacious Brooklyn Loft      21207
35        14290                         * ORIGINAL BROOKLYN LOFT *      56104
38        14377                   Williamsburg 1 bedroom Apartment      56512
42        15385                              Very, very cozy place      60252
...         ...                                                ...        ...
46484  44746041      Modern, light-filled apartment in Wiliamsburg    3317380
46489  44749327  Luxury 3 bedroom apartment Williamsburg ROOF P...  334780877
46493  44753863            Bright, spacious East Williamsburg loft   38062951
46513  44800276        Williamsburg 1 Bedroom, Spacious and Classy  361034257
46517  44802032                  A very large room in Williamsburg  213793805

             host_name neighbourhood_group neighbourhood  latitude  longitude  \
11       Allen & Irina            Brooklyn  Williamsburg  40.70837  -73.95352
15               Chaya            Brooklyn  Williamsburg  40.71842  -73.95718
35               James            Brooklyn  Williamsburg  40.70420  -73.93560
38              Joanna            Brooklyn  Williamsburg  40.70881  -73.95930
42            Cristina            Brooklyn  Williamsburg  40.71185  -73.96204
...                ...                 ...           ...       ...        ...
46484            Marge            Brooklyn  Williamsburg  40.71372  -73.95407
46489    Pedro & Maria            Brooklyn  Williamsburg  40.70902  -73.95610
46493           Nathan            Brooklyn  Williamsburg  40.70372  -73.93492
46513  Angelo + Amirah            Brooklyn  Williamsburg  40.71283  -73.95400
46517             Omer            Brooklyn  Williamsburg  40.71970  -73.95632

             room_type  price  minimum_nights  number_of_reviews last_review  \
11     Entire home/apt    109               2                181  2020-03-16
15     Entire home/apt    299               3                  9  2011-12-28
35     Entire home/apt    131               3                 95  2020-05-28
38     Entire home/apt    175              10                113  2020-01-24
42        Private room     80               7                 49  2020-02-07
...                ...    ...             ...                ...         ...
46484  Entire home/apt    250               7                  0         NaN
46489  Entire home/apt    464               4                  0         NaN
46493  Entire home/apt    100               7                  0         NaN
46513  Entire home/apt    180               7                  0         NaN
46517     Private room     55              14                  0         NaN

       reviews_per_month  calculated_host_listings_count  availability_365  \
11                  1.32                               1                 0
15                  0.07                               1               337
35                  0.73                               1               164
38                  0.87                               1               165
42                  0.39                               1               229
...                  ...                             ...               ...
46484                NaN                               1               164
46489                NaN                               1               344
46493                NaN                               1               146
46513                NaN                               1               364
46517                NaN                               1                45

       adjusted_price
11                209
15                399
35                231
38                275
42                180
...               ...
46484             350
46489             564
46493             200
46513             280
46517             155

[3486 rows x 17 columns]

In [14]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
total=len(df)
private_count=df['room_type'].value_counts()['Private room']
shared_count=df['room_type'].value_counts()['Shared room']
percent_private=(private_count/total) *100
percent_shared=(shared_count/total) *100
print(f"Percentage of rooms private is: {percent_private}, and percentage of rooms shared is: {percent_shared}") #i could format the fstring but im lazy

Percentage of rooms private is: 45.444580566122895, and percentage of rooms shared is: 2.12134889419047

In [11]:
#test cell, ignore
df['room_type'].unique()

array(['Entire home/apt', 'Private room', 'Shared room', 'Hotel room'],
      dtype=object)

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [18]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

df.groupby('neighbourhood_group').size()

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
dtype: int64

In [21]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 
df.groupby('neighbourhood_group')['price'].mean()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [22]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
df.groupby('room_type')['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [26]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 
df.groupby('neighbourhood_group')['price'].agg(['min','max'])

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [28]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.

df.groupby(['neighbourhood_group','room_type'])['price'].mean()

neighbourhood_group  room_type
Bronx                Entire home/apt    138.004819
                     Private room        68.419668
                     Shared room         66.391304
Brooklyn             Entire home/apt    171.587687
                     Hotel room         147.300000
                     Private room        71.291189
                     Shared room         57.870091
Manhattan            Entire home/apt    231.335572
                     Hotel room         292.515670
                     Private room       128.277069
                     Shared room        111.735084
Queens               Entire home/apt    150.168900
                     Hotel room         139.058824
                     Private room        69.972564
                     Shared room         89.891892
Staten Island        Entire home/apt    151.720930
                     Private room        70.312883
                     Shared room         46.000000
Name: price, dtype: float64

In [29]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.
df.groupby(['neighbourhood_group','room_type'])['price'].agg(['min','max','mean','std'])

                                     min    max        mean         std
neighbourhood_group room_type
Bronx               Entire home/apt   25   1404  138.004819  126.032106
                    Private room      16    700   68.419668   57.337866
                    Shared room       20    800   66.391304  114.442703
Brooklyn            Entire home/apt   20  10000  171.587687  236.732843
                    Hotel room         0    399  147.300000   91.153206
                    Private room      10   2500   71.291189   69.023165
                    Shared room       15   1500   57.870091   92.217618
Manhattan           Entire home/apt    0  10000  231.335572  410.306439
                    Hotel room         0   2211  292.515670  315.924085
                    Private room      10  10000  128.277069  448.677306
                    Shared room       10  10000  111.735084  502.728868
Queens              Entire home/apt   10  10000  150.168900  252.606739
                    Hotel room         0    249  139.058824   50.743806
                    Private room      18   9000   69.972564  163.814468
                    Shared room       14   3000   89.891892  275.675158
Staten Island       Entire home/apt   39   1200  151.720930  147.518392
                    Private room      20    800   70.312883   70.759593
                    Shared room       19     82   46.000000   28.446441

# Join and file saving.
1. Load the `prices.csv` and the `n_listings.csv`


2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']
       
       
3. Save your joined csv as `joined.csv`


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [58]:
# 1. Load the `prices.csv` and the `n_listings.csv`
df_prices=pd.read_csv('data/prices.csv')
df_listing=pd.read_csv('data/n_listings.csv')
#print(df_prices.columns,df_listing.columns) #test stuff
#print(df_listing['neighbourhood_group'])
df_listing[['neighbourhood_group', 'n_listings']] = df_listing['neighbourhood_group;n_listings'].str.split(';', expand=True)
df_listing.drop(columns=['neighbourhood_group;n_listings'],inplace=True)
df_joined=df_prices.merge(df_listing, on='neighbourhood_group', how='outer') #there's room to replace nans with a default value from the row, but i save that for another time
df_joined

  neighbourhood_group   mean_price n_listings
0               Bronx    92.751479       1183
1            Brooklyn   120.225258      18632
2          LongIsland          NaN       4121
3           Manhattan   191.880466      20580
4              Queens    99.754965        NaN
5       Staten Island   110.947214        NaN

In [18]:
# 2. Do join that keeps all the records for each table.
#print(df_prices.columns,df_listing.columns) #test stuff
#print(df_listing['neighbourhood_group'])
df_listing[['neighbourhood_group', 'n_listings']] = df_listing['neighbourhood_group;n_listings'].str.split(';', expand=True)
df_listing.drop(columns=['neighbourhood_group;n_listings'],inplace=True)
df_joined=df_prices.merge(df_listing, on='neighbourhood_group', how='outer') #there's room to replace nans with a default value from the row, but i save that for another time
df_joined

In [61]:
#load into csv stuff
df_joined.to_csv('data/joined.csv',index=False)
df_joined_read=pd.read_csv('data/joined.csv')
df_joined_read

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479      1183.0
1            Brooklyn   120.225258     18632.0
2          LongIsland          NaN      4121.0
3           Manhattan   191.880466     20580.0
4              Queens    99.754965         NaN
5       Staten Island   110.947214         NaN

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.